app/controllers/productos_controller.rb

SELECT * FROM "productos"
---
  def index
    @productos = Producto.all

INSERT INTO "productos" ("created_at", "nombre", "updated_at", "precio", "descripcion") VALUES('2010-01-29 02:07:43', 'ejemplo', '2010-01-29 02:07:43', 33.0, 'djdje')
---
  def create
    @producto = Producto.new(params[:producto])

    respond_to do |format|
      if @producto.save

DELETE FROM "productos" WHERE "id" = 3
---
  def destroy
    @producto.destroy