app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-02-02 23:56:01', "crypted_password" = '8c0f57addf332d1dcaffc13387642db2ee78244b' WHERE "id" = 1

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'e3f464ab2d41bd5ef654c88e4714266cf74c2f1b', '2010-02-02 23:11:37', 'b1dab227b869aba8589f56ed175588863f01b8cf', NULL, '2010-02-02 23:11:37', NULL, 'igmarin', 'ismael.marin@gmail.com')